<?php

return [
    'admin' => [
        'information' => 'معلوماتك الشخصية',
        'title' => 'User Profile',
        'yours' => 'ملفك الشخصي',
        'name' => 'الاسم',
        'email' => 'البريد الالكتروني',
        'birthdate' => 'تاريخ الميلاد',
        'password' => [
            "password" => "كلمة السر",
            'update' =>  'تغيير كلمة السر',
            'new' =>  'كلمة السر الجديدة',
            'current' =>  'كلمة السر الحالية',
            'confirm' =>  'تأكيد كلمة السر',
        ],
        'genders' => [
            'gender' => 'الجنس',
            'male' => 'ذكر',
            'female' => 'أنثى',
        ],
    ],

    'availability' => [
        'title' => 'توفر المسؤول',
        'auditor' => 'مدقق',
        'level_manager' => 'مدير مستوى',
        'ownership_transfer' => 'نقل الملكية',
        'desc' => [
            'auditor' => 'ستكون متاحًا ليتم تعيينك كمدقق في مسابقات أخرى.',
            'level_manager' => 'ستكون متاحًا ليتم تعيينك كمدير مستوى في مسابقات أخرى وإدارة أسئلة المستوى.',
            'ownership_transfer' => 'ستكون متاحًا لاستبدال المسؤولين المحذوفين وتولي ملكية مسابقاتهم والإجابات التي تم تدقيقها.'
        ],
        'on' => 'تشغيل',
        'off' => 'إيقاف',
        'update' => 'تحديث',
    ],
    'availability_updated' => 'تم تحديث التوفر بنجاح.',

];
