<?php

return [
    /*
    |--------------------------------------------------------------------------
    | validation Language Lines
    |--------------------------------------------------------------------------
    |
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */
    'info' => [
        'competition' => 'المسابقة',
        'information' => 'معلومات المسابقة',
        'title' => 'اسم المسابقة',
        'description' => 'الوصف',
        'created_by' => 'أنشئ بواسطة',
        'start_date' => 'تاريخ الانطلاق',
        'users_age' => 'عمر المتسابقين',
        'from' => 'من',
        'to' => 'الى',
        'age_start' => 'العمر الادنى',
        'age_end' => 'العمر الاقضى',
        'status' =>[
            'state' =>  'الحالة',
            'active' =>  'جارية',
            'pending' =>  'غير نشط',
            'finished' =>  'منتهية',
        ],
        'coming' =>  'المسابقات القادمة',
        'active' =>  'المسابقات الجارية',
        'finished' =>  'المسابقات المنتهية',
        'levels_number' => 'عدد المراحل',
        'competitor' => 'المتسابق',
        'competitors' => 'المتسابقين',
        'competitors_not_in' => 'المتسابقين الذين ليسوا مشتركين',
        'user_auth' => 'مسابقاتي',
        'auditor' =>[
            'info' => 'معلومات المصحح',
            'information' => 'معلومات المصححين',
            'list' => 'قائمة المصححين',
            'not_in' => 'مسؤولين ليسوا في قائمة المصححين',
            'all_audited' => 'تم التصحيح',
            'not_audited' => 'لم يتم التصحيح',
            'in_competition' => 'مصحح في المسابقات'
        ]
    ],
    'level' => [
        'level' => 'المرحلة',
        'info' => 'معلومات المرحلة',
        'information' => 'معلومات المراحل',
        'name' => 'اسم المرحلة',
        'duration' => 'المدة',
        'questions_number' => 'عدد الاسئلة',
        'admin' => 'مسؤول المرحلة',
        'only_manager_change' => 'تغيير مسؤول المرحلة فقط (استخدام نظام الموافقة)'
    ],
    'question' => [
        'the_question' => 'السؤال',
        'info' => 'معلومات السؤال',
        'list' => 'قائمة الاسئلة',
        'question_text' => 'نص السؤال ',
        'max_score' => 'العلامة الكاملة',
        'duration' => 'المدة',
        'level' => 'المرحلة',
        'start_solve' => 'إبدأ الاجابة',
        'no_question'=> 'لا يوجد أسئلة متاحة',
        'try_later' => 'أعد المحاولة لاحقا',

    ],
    'response' =>[
        'info' => 'اجاباتك',
        'list' => 'قائمة الاجابات',
        'response' => 'الاجابة',
        'response_text' => 'نص الاجابة',
        'response_duration' => 'مدة الاجابة',
        'score' => 'العلامة',
        'user_response' => 'إجابة المتسابق',
        'final_score' => 'العلامة النهائية',
        'congratulation'=> 'تهانينا, إجابة صحيحة',
        'failed' => 'للأسف, إجابة خاطئة',
        'try_again' => 'حاول مجددا',
        'play_more' => 'واصل اللعب',
        'penalty' => 'العقوبة',
        'flag' => [
            'tab_switch' => 'تبديل التبويبات',
            'copy_paste' => 'نسخ ولصق',
            'low_keystrokes' => 'عدد ظغطات لوحة المفاتيح منخفض',
            'suspicious_wpm' => 'عدد كلمات في الدقيقة مرتفع',
            'too_fast_long_answer' => 'كتابة طويلة في وقت قصير',
        ],
        'rules' => [
            'title' => 'قواعد الاجابة',
            'close_browser' => 'إغلاق المتصفح سيؤدي الى إرسال إجابة فارغة',
            'switch_tab' => 'التبديل بين التبويبات سيؤدي الى عقوبة, تقليل العلامة بنسبة 15%',
            'copy_paste' => 'النسخ واللصق سيؤدي الى عقوبة, تقليل العلامة بنسبة 20%',
            'low_keystrokes' => 'إذا كانت الاجابة بعدد كلمات كبير وعدد ظغطات لوحةالمفاتيح منخفض, سيؤدي الى عقوبة, تقليل العلامة بنسبة 20%',
            'suspicious_wpm' => 'إذا كان عدد الكلمات في الاجابة في الدقيقة مرتفع (أكثر من 90 : عدد الكلمات / المدة), سيؤدي الى عقوبة, تقليل العلامة بنسبة 10%',
            'too_fast_long_answer' => 'إذا كان عدد الأحرف في الاجابة في الثانية مرتفع (أكثر من 10 : عدد الأحرف / المدة), سيؤدي الى عقوبة, تقليل العلامة بنسبة 20%',
        ]
    
    ],
    'result' => [
        'level' => 'نتائج المرحلة',
        'competition' => 'نتائج المسابقة',
        'temp' => 'نتائج مؤقتة',
    ],
    'global' => [
        'choices' => 'الاختيارات',
        'choice' => 'الاختيار',
        'question' => 'الأسئلة العامة',
        'condition' => [
            'random' => 'سيتم اختيار سؤال عشوائي في كل مرة.',
            'choices_number' => 'كل سؤال يمتلك من خيارين الى خمسة احدهم هو الصحيح.',
            'wrong_response' => 'لن يظهر لك نفس السؤال أكثر من مرتين في حالة الخطأ.',
            'time' => 'كل سؤال له مدة اجابة كلما طالت هاته المدة, نقصت العلامة المحصل عليها.',
            'final_score' => 'العلامة = علامة السؤال - (مدة الاجابة / المدة * (علامة السؤال / 2))',
        ],
    ]
];
