<?php
return [
    'admin' => [
            'add' => "إضافة مسؤول جديد",
            'delete' => "إزالة مسؤول"
    ],
    'user' => [
        'add' => "إضافة مستخدم جديد",
        'delete' => "ازالة مستخدم"
    ],
    'actions' => [
        "save" => "حفظ",
        "add" => "أضــف",
        "update" => "تحديث",
        "change" => "تغيير",
        "delete" => "حذف",
        "confirm_delete" => "هل أنت متأكد من اتمام عملية الازالة",
        'login' => "تسجيل الدخول",
    ],
    'title' => [
        "rest_password" => "إعادة تعيين كلمة السر",
        "login" => "تسجيل الدخول",
    ]
];
