<?php
return [
    'admin' => [
            'add' => "إضافة مسؤول جديد",
            'delete' => "إزالة مسؤول"
    ],
    'user' => [
        'add' => "إضافة مستخدم جديد",
        'delete' => "ازالة مستخدم"
    ],
    'competition' => [
        'add' => "إضافة مسابقة جديد",
        'delete' => "ازالة مسابقة"
    ],
    'competitor' => [
        'add' => "إضافة متسابقين",
        'delete' => "ازالة متسابق"
    ],
    'level' => [
        'add' => "إضافة مرحلة جديدة",
        'delete' => "ازالة مرحلة"
    ],
    'actions' => [
        "save" => "حفظ",
        "add" => "أضــف",
        "update" => "تحديث",
        "change" => "تغيير",
        "delete" => "حذف",
        "confirm_delete" => "هل أنت متأكد من اتمام عملية الازالة",
        "confirm_competitor_add" => "هل أنت متأكد من إضافة المتاسبقين الذين قمت بتحديدهم",
        'login' => "تسجيل الدخول",
        'show' => "أظهر",
    ],
    'title' => [
        "rest_password" => "إعادة تعيين كلمة السر",
        "login" => "تسجيل الدخول",
    ]
];
