<?php
return [
    'admin' => [
            'add' => "إضافة مسؤول جديد",
            'delete' => "إزالة مسؤول"
    ],
    'user' => [
        'add' => "إضافة مستخدم جديد",
        'delete' => "ازالة مستخدم"
    ],
    'competition' => [
        'add' => "إضافة مسابقة جديد",
        'delete' => "ازالة مسابقة"
    ],
    'competitor' => [
        'add' => "إضافة متسابقين",
        'delete' => "ازالة متسابق"
    ],
    'auditor' => [
        'add' => "إضافة مصححين",
        'delete' => "ازالة مصحح"
    ],
    'level' => [
        'add' => "إضافة مرحلة جديدة",
        'delete' => "ازالة مرحلة"
    ],
    'question' => [
        'add' => "إضافة سؤال جديد",
    ],
    'global_question' => [
        'add' => "إضافة سؤال عام جديد",
        'delete' => "ازالة سؤال عام",
        'approve' => "الموافقة على سؤال عام"
    ],
    'job' => [
        'remove' => "ازالة مهام",
    ],
    'deletion' => [
        'hard_delete' => "تأكيد الحذف النهائي",
        'restore' => "تأكيد الاستعادة",
    ],
    'process_delayed' => [
        'delete' => "ازالة سجل عملية مؤجلة",
    ],
    'notification' => [
        'delete' => "ازالة الاشعارات",
    ],
    'filter' => [
        'filter' => 'فلترة',
        'all' => 'الكل',
    ],
    'actions' => [
        "save" => "حفظ",
        "add" => "أضــف",
        "update" => "تحديث",
        "change" => "تغيير",
        "delete" => "حذف",
        "delete_all" => "ازالة الكل",
        "hard_delete" => "حذف نهائي",
        "restore" => "استعادة",
        "actions" => "الإجراءات",
        "confirm_delete" => "هل أنت متأكد من اتمام عملية الازالة",
        'confirm_approve' => "هل أنت متأكد من الموافقة على هذا السؤال",
        "confirm_competitor_add" => "هل أنت متأكد من إضافة المتاسبقين الذين قمت بتحديدهم",
        'confirm_auditor_add' => 'هل أنت متأكد من إضافة المصححين الذين قمت بتحديدهم؟',
        'confirm_job_remove' => 'هل أنت متأكد من إزالة المهام التي قمت بتحديدها',
        'login' => "تسجيل الدخول",
        'register' => "إنشاء حساب",
        'show' => "أظهر",
        'activate' => "تنشيط",
        'finish' => 'إنهاء',
        'filter' => 'تصفية',
        'generate' => 'أنشأ',
        'start' => 'إبدأ',
        'back' => 'السابق',
        'auto_audit' => 'أكد تقييم الاجابات',
        'reassign_level_auditor' => [
            'title' => 'أعد اسناد الاجابات',
            'tooltip' => 'أعد اسناد اجابات المستخدمين التي لم تدقق للمنشئ (لك)',
        ]
    ],
    'title' => [
        "rest_password" => "إعادة تعيين كلمة السر",
        "login" => "تسجيل الدخول",
        'register' => "إنشاء حساب جديد",

    ]
];
