<?php
return [
    'admin' => [
            'add' => "إضافة مسؤول جديد",
            'delete' => "إزالة مسؤول"
    ],
    'user' => [
        'add' => "إضافة مستخدم جديد",
        'delete' => "ازالة مستخدم"
    ],
    'competition' => [
        'add' => "إضافة مسابقة جديد",
        'delete' => "ازالة مسابقة"
    ],
    'competitor' => [
        'add' => "إضافة متسابقين",
        'delete' => "ازالة متسابق"
    ],
    'auditor' => [
        'add' => "إضافة مصححين",
        'delete' => "ازالة مصحح"
    ],
    'level' => [
        'add' => "إضافة مرحلة جديدة",
        'delete' => "ازالة مرحلة"
    ],
    'question' => [
        'add' => "إضافة سؤال جديد",
    ],
    'global_question' => [
        'add' => "إضافة سؤال عام جديد",
        'delete' => "ازالة سؤال عام"
    ],
    'filter' => [
        'filter' => 'فلترة',
        'all' => 'الكل',
    ],
    'actions' => [
        "save" => "حفظ",
        "add" => "أضــف",
        "update" => "تحديث",
        "change" => "تغيير",
        "delete" => "حذف",
        "confirm_delete" => "هل أنت متأكد من اتمام عملية الازالة",
        "confirm_competitor_add" => "هل أنت متأكد من إضافة المتاسبقين الذين قمت بتحديدهم",
        'confirm_auditor_add' => 'هل أنت متأكد من إضافة المصححين الذين قمت بتحديدهم؟',
        'login' => "تسجيل الدخول",
        'register' => "إنشاء حساب",
        'show' => "أظهر",
        'activate' => "تنشيط",
        'finish' => 'إنهاء',
        'filter' => 'تصفية',
        'generate' => 'أنشأ',
        'start' => 'إبدأ',
    ],
    'title' => [
        "rest_password" => "إعادة تعيين كلمة السر",
        "login" => "تسجيل الدخول",
        'register' => "إنشاء حساب جديد",

    ]
];
